import PostType from "../../types/post";

export const PostMock: PostType = {
  slug: "test-mock",
  title: "あのイーハトーヴォのすきとおった風、夏でも底に冷たさをもつ青いそら",
  date: "2021/02/28",
  lastmod: "2021/03/01",
  eyecatch: "https://source.unsplash.com/uwrWzRKRd3M/1200x630/",
  description:
    "あのイーハトーヴォのすきとおった風、夏でも底に冷たさをもつ青いそら、うつくしい森で飾られたモリーオ市、郊外のぎらぎらひかる草の波",
  tags: ["blog", "vancouver"],
  content: `
    <h2>あのイーハトーヴォのすきとおった風</h2>

    <p>
    あのイーハトーヴォのすきとおった風、夏でも底に冷たさをもつ青いそら、うつくしい森で飾られたモリーオ市、郊外のぎらぎらひかる草の波。
    またそのなかでいっしょになったたくさんのひとたち、ファゼーロとロザーロ、羊飼のミーロや、顔の赤いこどもたち、地主のテーモ、山猫博士のボーガント・デストゥパーゴなど、
    いまこの暗い巨きな石の建物のなかで考えていると、みんなむかし風のなつかしい青い幻燈のように思われます。
    では、わたくしはいつかの小さなみだしをつけながら、しずかにあの年のイーハトーヴォの五月から十月までを書きつけましょう。
    </p>
  `,
};
